//---------------------------------------------------------
// 시작 페이지
//---------------------------------------------------------
const PAGE_HOME = `/src/main/webapp/WEB-INF/index.html`

//---------------------------------------------------------
// 서버 IP, PORT 정보
//---------------------------------------------------------
const SERVER = {
    // HOST: '192.168.111.101', 
    HOST: 'localhost', 
    PORT: 6098
}

//---------------------------------------------------------
// 컨트롤 종류(분류) 정보
//---------------------------------------------------------
const CONTROL_OPTION = {
    TREE        : 'TR', // 트리
    SELECTBOX   : 'SB', // 셀렉트박스
    COMBOBOX    : 'CB', // 콤보박스
}

export default {
    PAGE_HOME       // 시작 페이지 경로
  , SERVER          // 서버 IP, PORT 정보
  , CONTROL_OPTION  // 컨트롤 종류(분류) 정보
}



